#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<string.h>



//int main()
//{
//	double a = 5.0 / 2;  // 商2余1
//	printf("%f", a);
//	return 0;
//}

//int main()
//{
//
//	int a = -1;
//	//>>   -右移位操作符
//	//移动的是二进制位
//	//10000
//	int b=a >> 1;
//	printf("%d", b);
//
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//整数的二进制的表示有：原码、反码、补码 
//	//存储到内存中的是补码
//	//100000000000000000000000000000001   -原码
//	//111111111111111111111111111111110   -反码（符号位不变其他改变）
//	//111111111111111111111111111111111   -补码
//	int b = a << 1;
//	printf("%d", b);
//
//
//
//
//	return 0;
//}


//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	printf("%d",b);
//
//
//
//
//	return 0;
//}


//int main()
//{
//	////& -按二进制与
//	//int a = 3;
//	//int b = 5;
//	//int c = a & b;
//	//   &按位与
//	////00000000000000000000000000000011
//	////00000000000000000000000000000101
//	////00000000000000000000000000000001
//	////一个是0就是0，两个都是1才是1
//	//printf("%d", c);
//	
//
//
////	// | -按二进制或
////	int a = 3;
////	int b = 5;
////	int c = a | b;
////	printf("%d\n", c);
////	//  |按位或
////	//00000000000000000000000000000011
////    //00000000000000000000000000000101
////    //00000000000000000000000000000111
////	//一个是1就是1，两个为0才是0
////
////	int a = 3;
////	int b = 5;
////	int c = a^b;
////	printf("%d\n", c);
////	//按二进制位
////	//对应的的相同为0，相异为1
////	// 	   ^按位异或
////	//00000000000000000000000000000011
////	//00000000000000000000000000000101
////	//00000000000000000000000000000110
////	return 0;
////}



//int main()
//{
//	//不使用中间变量去交换两个数的值
//	//加减法
//	//int a = 3;
//	//int b = 5;
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//printf("%d %d", a, b);
//
//	//异或的方法不需中间变量交换两个数的值
//	int a = 3;
//	int b = 5;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("%d %d", a,b);
//
//
//
//
//	return 0;
//}


//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);
//	//统计num的补码中有几个1
//	while (num != 0)
//	{
//		if (num % 2 == 1)
//		{
//			count++;
//			num = num / 2;
//		}
//	
//	}
//	printf("%d", count);
//
//
//
//
//	return 0;
//}


int main()
{
	int num = 0;
	int count = 0;
	scanf("%d", &num);
	int i;
	for (i = 0; i < 32; i++)
	{
		if (((num >> i) & 1) == 1)
		{
			count++;
		}
	}


	printf("%d", count);



	return 0;
}